---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.HostId
source: html/f61a779d-6368-ac14-4d9b-e038eafa27ed.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.HostId Property

The id of the Host element for the fabric area.

## Syntax (C#)
```csharp
public ElementId HostId { get; }
```